# Mix values

In [19]:
import pandas as pd
import numpy as np
import os

In [2]:
path = r'C:/Users/richardniyongabo/Documents/Careerfoundry/4.5 Data Consistence Checks/MM-2020 Instacart Basket Analysis'

In [8]:
df_prods = pd.read_csv("/Users/richardniyongabo/Documents/Careerfoundry/4.5 Data Consistence Checks/MM-2020 Instacart Basket Analysis/02 Data/Original Data /4/products.csv")

In [9]:
df_orders = pd.read_csv("/Users/richardniyongabo/Documents/Careerfoundry/4.5 Data Consistence Checks/MM-2020 Instacart Basket Analysis/02 Data/Original Data /4/orders.csv")

In [12]:
 df_orders.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [13]:
df_test = pd.DataFrame()

In [14]:
df_test['mix'] = ['a', 'b', 1, True]

In [15]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [17]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [18]:
df_test['mix'] = df_test['mix'].astype('str')

# Missing Values

In [20]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [37]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [38]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [44]:
df_prods.shape

(49693, 5)

In [45]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [46]:
df_prods_clean.shape

(49677, 5)

# Find duplicates

In [48]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [49]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [53]:
df_prods_clean.shape

(49677, 5)

In [54]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [56]:
df_prods_clean_no_dups.shape

(49672, 5)

# Task 4.5

# Data consistency assurance

In [58]:
df_orders.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

# Mix of data

In [59]:
# creating a dataframe
df_test = pd.DataFrame()

In [111]:
# Create a mix data type column
df_test['mix'] = ['a','b',1,True]

In [60]:
# check for mixed types (using test code)
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

# Addressing missing values

In [62]:
# check for missing data in the 'product_name' column
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [63]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [64]:
#Filling in with the mean or median value
#df['column with missings'].fillna(mean value, inplace=True)

#df['column with missings'].fillna(median value, inplace=True)

In [65]:
#checking the rows of the df
df_prods.shape

(49693, 5)

In [66]:
df_nan.shape

(16, 5)

In [68]:
# Removing missing values 
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [69]:
df_prods_clean.shape

(49677, 5)

# Exporting Data

In [75]:
#df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

In [76]:
# Task 1. Run the df.describe() function on your df_prods dataframe.
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [77]:
# The min value and count are the only consistent values for all the columns.

In [79]:
# Task 2. Check for mixed-type data in your df_ords dataframe
for col in df_orders.columns.tolist():
  weird = (df_orders[[col]].applymap(type) != df_orders[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_orders[weird]) > 0:
    print (col)

In [80]:
 # No mix datatypes

In [82]:
# Running a check for missing values in your df_ords dataframe
df_orders.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [84]:
# Dataframe for the missing values
df_orders_nan = df_orders[df_orders['days_since_prior_order'].isnull() == True]

In [86]:
df_orders_nan

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

# Missing values due to multiple customers that may require a new column of boolean data type separating of old and new customers

In [88]:
# Addressing the missing values.

In [89]:
# New dataframe and setting a new column for customer
df_orders_clean = df_orders

In [91]:
df_orders_clean['new_customer'] = df_orders['days_since_prior_order'].isnull() == True

In [93]:
df_orders_clean

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,new_customer
0,2539329,1,prior,1,2,8,NaN,True
1,2398795,1,prior,2,3,7,15.0,False
2,473747,1,prior,3,3,12,21.0,False
3,2254736,1,prior,4,4,7,29.0,False
4,431534,1,prior,5,4,15,28.0,False
...,...,...,...,...,...,...,...,...
3421078,2266710,206209,prior,10,5,18,29.0,False
3421079,1854736,206209,prior,11,4,10,30.0,False
3421080,626363,206209,prior,12,1,12,18.0,False
3421081,2977660,206209,prior,13,1,12,7.0,False
3421082,272231,206209,train,14,6,14,30.0,False

# Procedure to identify new and old customer

In [94]:
# Checking duplicate values in your df_orders data.

In [95]:
df_orders_dups = df_orders_clean[df_orders_clean.duplicated()]

In [96]:
df_orders_dups

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order, new_customer]
Index: []

# No duplicates identified

In [98]:
# Exporting final, cleaned df_products and df_orders data as “.csv” files

In [117]:
df_orders_clean.to_csv(os.path.join(path, '/Users/richardniyongabo/Documents/Careerfoundry/4.5 Data Consistence Checks/MM-2020 Instacart Basket Analysis/02 Data/Original Data /4/orders.csv'))

In [121]:
df_orders_clean.to_csv(os.path.join(path, '/Users/richardniyongabo/Documents/Careerfoundry/4.5 Data Consistence Checks/MM-2020 Instacart Basket Analysis/02 Data/Original Data /4/products.csv'))